{"id":"f1a4ed07-12c4-4095-8451-435877d3a306","updated_at":"2025-07-28T11:45:51.845Z","updated_by":"337259977","created_at":"2025-07-28T11:45:51.845Z","created_by":"337259977","name":"Command Prompt Usage Alert !","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"command prompt used by creating a process","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"https://38a491c7469d45cebc6ee29348f7a79a.us-central1.gcp.cloud.es.io/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"7cd838c9-b0c0-49c1-abee-f8597b44d3f7","max_signals":10,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.dataset : \"windows.sysmon_operational\" and process.command_line : whoami* and process.parent.name: cmd*","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
