{"id":"d4bae2e2-21e2-4c41-b066-aaa7409e130f","updated_at":"2025-07-28T13:18:35.215Z","updated_by":"337259977","created_at":"2025-07-28T08:34:24.653Z","created_by":"337259977","name":"Nmap scanning Alert","tags":[],"interval":"5m","enabled":true,"revision":1,"description":"Nmap scanning found in the network","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"https://38a491c7469d45cebc6ee29348f7a79a.us-central1.gcp.cloud.es.io/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"e5712c17-7a50-4879-aa40-b8f4b6e11dd7","max_signals":10,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1046","name":"Network Service Discovery","reference":"https://attack.mitre.org/techniques/T1046/","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.dataset : \"zeek.http\" and user_agent.original : *nmap*","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
