{"id":"2c24e495-4eac-4f64-8e7a-d9e504bb06b9","updated_at":"2025-07-28T10:52:21.765Z","updated_by":"337259977","created_at":"2025-07-28T08:04:17.425Z","created_by":"337259977","name":"exe files download ALERT!","tags":[],"interval":"5m","enabled":true,"revision":1,"description":"observing network logs which has exe files ","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"https://38a491c7469d45cebc6ee29348f7a79a.us-central1.gcp.cloud.es.io/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"4e3be7cd-a7c8-42a2-8065-9194b48849e8","max_signals":10,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.dataset : \"zeek.http\" and url.extension : exe*","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
